app/controllers/buddies_controller.rb

  def index
    @buddies = Buddy.all
---
SELECT "buddies".* FROM "buddies"

  def create
    @buddy = Buddy.new(buddy_params)

    respond_to do |format|
      if @buddy.save
---
INSERT INTO "buddies" ("first_name", "last_name", "phone_num", "github", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "Anicet"], ["last_name", "Murhula"], ["phone_num", "+250786094847"], ["github", ""], ["created_at", "2022-07-25 13:16:08.104232"], ["updated_at", "2022-07-25 13:16:08.104232"]]

  def destroy
    @buddy.destroy
---
DELETE FROM "buddies" WHERE "buddies"."id" = $1  [["id", 1]]

    def set_buddy
      @buddy = Buddy.find(params[:id])
---
SELECT "buddies".* FROM "buddies" WHERE "buddies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]